//
// Created by TD on 2021/9/8.
//

#pragma once

/**
 * @todo 文件上传和文件路径标记功能
 * @todo ue4 插件环境光需要散射初始参数更改
 *
 * @todo 添加更好的maya fbx摄像机过滤和击中功能
 * @todo 更改maya 解算标记按钮 添加gui(maya插件要重写一下)
 * @todo 添加解算时使用的属性伸缩标记功能
 * @todo 解算是同时导出fbx文件
 *
 * @todo 添加拍屏审核功能
 * @todo 将拍屏放入maya和ue插件中
 *
 *
 * @todo 批量文件扫描添加
 *
 * @todo 大致匹配fmt字符串的正则表达式 \{(\w+)(:[^\{\}]?[<>\^]?[\+-]?#?0?(\d+|(\{\w+\}))?\.?(\d+|(\{\w+\}))?L?[\w]?)\}
 *   \{(\w+)(:[^\{\}]?[<>\^]?[\+-]?#?0?(?:\d+|(?:\{\w+\}))?\.?(?:\d+|(?:\{\w+\}))?L?[\w]?)\}
 *
 * @todo 添加ql布料初始化
 * @todo 检查制作包裹时模型问题
 *
 */
